roboticagolem/bootloader/roboticagolem/samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache

# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache

roboticagolem_golem.name=Golem
roboticagolem_golem.vid.0=0x1209
roboticagolem_golem.pid.0=0xBAB1
roboticagolem_golem.vid.1=0x1209
roboticagolem_golem.pid.1=0xBAB1
roboticagolem_golem.upload.tool=bossac
roboticagolem_golem.upload.protocol=sam-ba
roboticagolem_golem.upload.maximum_size=253952
roboticagolem_golem.upload.offset=0x2000
roboticagolem_golem.upload.use_1200bps_touch=true
roboticagolem_golem.upload.wait_for_upload_port=true
roboticagolem_golem.upload.native_usb=true
roboticagolem_golem.build.mcu=cortex-m0plus
roboticagolem_golem.build.f_cpu=48000000L
roboticagolem_golem.build.usb_product="Golem"
roboticagolem_golem.build.usb_manufacturer="Robotica Golem"
roboticagolem_golem.build.board=golem
roboticagolem_golem.build.core=arduino
roboticagolem_golem.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21G18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
roboticagolem_golem.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
roboticagolem_golem.build.openocdscript=openocd_scripts/SAMD21G15A.cfg
roboticagolem_golem.build.variant=golem
roboticagolem_golem.build.variant_system_lib=
roboticagolem_golem.build.vid=0x1209
roboticagolem_golem.build.pid=0xBAB1
roboticagolem_golem.bootloader.tool=openocd
roboticagolem_golem.bootloader.file=golem/bootloader-golem.bin